update Architecture Mermaid chart
